11/data/attachments/757ec07f7e040676.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_de9d98e6-9559-44bd-88b2-c898b2af328d</nif:username>
            <nif:friendToBeAdded>Ashley_safe_Actions_88354_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>